{
	"blogAuthor": "Adrian Tennies",

	"entries": [
		{
			"Title": "My First Hackathon!",
			"PublishedDate": "August 13 2025",
			"Content": "The past about 3 days I've been at Shipwrecked, hosted by Hack Club, and here will be an overview of my experiences: <br><br>**Day 1**<br>Before the event had fully started, I had been hanging out with some of the other people who went to the event, so the hype had been killing me while I was getting ready to go, but once we got there, I didn't know many people from how they looked, as many people are usually anonymous online. Before we went to the island, we had a couple hours to hang out before we got on the ferry to the island. I tried to connect names to faces, and did okay with that, and traded stuff from our countries of origin. On the ferry, I talked with some friends, excited for the next couple days ahead of me. <br><br> Once we arrived at the island, I ran to my island and tried to set up my badge, which was a PCB, designed by another kid who was also participating, who was also a great person to hang out with, the badges had issues being set up, especially since I use linux and firefox, both of which were less extensively tested out, but at the end I managed to get them working, and people made very interesting applications for them, including a game using the radio sensor to play hide and seek with them. I didn't personally make anything for it, and mostly worked on projects for the story part of the event. <br><br>The goal of the hackathon was to complete a series of projects, each with a different challenge, and getting a prize in exchange. I started in a group with my roommates, with the challenge for that project being that there could be no words, nor numbers in your app/game, and my team decided to make a mobile and desktop app for tracking mood, and graphing it, and that was what we worked on for the rest of the day. <br><br>**Day 2**<br> Halfway through working on our app, there was a challenge where whoever built the tallest \"House\", where my team ended up winning by making ours hang from a tree, yet still connect to the ground, and because we reached won, everyone on the team got either an Orpheus(the Hack Club Mascot) Plushie, or a BLÅHAJ, and I chose an Orpheus Plushie, which I was told I would get later on.<br><br> Later on, my group had to present it, which went poorly, as we had to show it in action, and there wasn't a way for us to screenshare a phone without just having a camera pointed at the screen, but it did work in the end. After everyone presented, we were told that the next challenge was to make an app that was multiplayer in some form. I decided that I wanted to try a new team, but never found anyone who had an idea that I would be able to help with much, as I'm not a very skilled programmer at the time of writing this. <br><br>The night ended with having s'mores and giving away cat ears to people(I brought 70 cat ears, and tried to get as many people as I could to wear them.)<br><br>**Day 3** <br> I started that day late, as I accidentally slept in until 11:00, and my project was due at 14:00(or 2:00pm), so I started trying to rack my head for an idea of what to make, and ended up deciding to make a multiplayer drawing board, except you couldn't see what you were drawing, and ended up finished it, and having people try it, where it ended up working, and people had fun with messing with it.<br><br> Directly after the showcase, we had Hot Ones, where anyone who got through all 10 hot sauces would get a plush, extra stickers, or limited edition hackclub socks. I ended up finishing it, and getting people very concerned about me, as I wasn't reacting as much as a lot of people around me. After that ordeal, we were assigned our next project requirement, which was to make an app/game with as many colors as you could. Before my team got anywhere with our project, We had the talentless show, where I performed Ghost Town by Kanye West with ErrorCodeZero(check him out below), and then watched a bunch of others.<br><br> After mine and a couple others, I moved over to the tables with my team, where we ended up deciding upon a clicker game. We were planning to try and get bright colors through having a rotating background. <br><br>**Day 4(Finale)**<br> I spent the full night and morning working with my group on the project, before trying to present it later that day. Due to time constraints, it ended up very rushed by the end, and in an unfinished state, but had a lot of bright colors. Right after everyone showed off their projects, we had a presentation from the organizers, then took a picture of everyone at the island, and then got a couple group pictures of smaller groups, and friends we made there. Soon after, we started to depart from the island, getting back onto the ferry.<br><br> As I saw the island disappear from my vision I wished I could've stayed longer, it felt like it flew by, but I still loved almost every minute of it. I'd like to give a huge thank you to all the organizers and reviewers for doing this, it was a great experience!                           <br><br>** If you want to see some of the people that made shipwrecked as great of an experience as it was, you can see a couple below:**<br><a href=\"https://arjav.dino.icu\" target=\"_blank\">Arjav</a><br><a href=\"http://jeremywoolley.com/\" target=\"_blank\">Jeremy</a><br><a href=\"https://errorcodezero.dev/\" target=\"_blank\">ErrorCodeZero</a><br><a href=\"https://shaurya.studio/\" target=\"_blank\">Shaurya</a><br><a href=\"https://phaedras.space\" target=\"_blank\">Phaedra</a><br><a href=\"http://yanchengzhao.com/\" target=\"_blank\">Yancheng</a><br><a href=\"https://foxmoss.com\" target=\"_blank\">FoxMoss</a><br><a href=\"https://p-t.hackclub.app/web-sites/\" target=\"_blank\">ParkingTurkeys</a><br><a href=\"https://cattn.dev/\" target=\"_blank\">Cattn</a><br><a href=\"https://linktr.ee/archonic\" target=\"_blank\">Archonic/Gabe</a><br>Nick Esselman<br><a href=\"http://blog.nickesselman.nl/\" target=\"_blank\">Nick</a><br><a href=\"https://www.youtube.com/@magmalabs3472\" target=\"_blank\">Alex Li</a><br><a href=\"https://sahil.ink\" target=\"_blank\">Sahil</a><br><a href=\"https://shymike.dev\" target=\"_blank\">ShyMike</a><br><a href=\"http://jleuthardt.com/\" target=\"_blank\">Jake</a>"
		},
		{
			"Title": "My Newfound interest",
			"PublishedDate": "July 18 2025",
			"Content": "I've spent the last couple of days looking into the world of Plan 9 and it's distributions, such as 9 Legacy, and 9Front. I haven't managed to successfully install it in a Virtual Machine as of yet though, but from looking into it, along with the organization behind it, Bell Labs. <br>  Ever since the first night of research, I've been interested in trying Plan9, and plan to next time I have the free time to, or whenever I feel like trying to modify my VM's data enough that it'll boot."
		}
	]
}
